note/drawio/converted/dot/260506-sr04-v2-fsm.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_KuxB96fk1PK30fdosjAa_15" [label="SR04_start == 1"];
  "n_KuxB96fk1PK30fdosjAa_16" [label="usec_tick >= 11"];
  "n_KuxB96fk1PK30fdosjAa_17" [label="echo == 1"];
  "n_KuxB96fk1PK30fdosjAa_18" [label="echo == 0"];
  "n_KuxB96fk1PK30fdosjAa_2" [label="IDLE"];
  "n_KuxB96fk1PK30fdosjAa_4" [label="STARTtrig = 1"];
  "n_KuxB96fk1PK30fdosjAa_6" [label="WAIT"];
  "n_KuxB96fk1PK30fdosjAa_8" [label="RESPONSE"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_1" [label="IDLE"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_11" [label="trig = 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_13" [label="tick_us == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_16" [label="tick_cnt ++"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_18" [label="tick_cnt >= 11"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_2" [label="trig = 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_20" [label="Wait"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_22" [label="True"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_24" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_25" [label="True"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_26" [label="trig = 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_28" [label="tick_us == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_31" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_32" [label="True"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_34" [label="echo == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_36" [label="tick_cnt = 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_39" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_4" [label="SR04_start==1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_40" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_41" [label="response"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_43" [label="tick_us == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_47" [label="tick_cnt ++"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_49" [label="echo == 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_51" [label="distance = tick_cnt / 58"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_7" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_9" [label="Start"];
  "n_enB7lwsSKnQhAznJWjNS_1" [label="node_WjNS-1"];
  "n_enB7lwsSKnQhAznJWjNS_10" [label="trig = 1"];
  "n_enB7lwsSKnQhAznJWjNS_11" [label="node_jNS-11"];
  "n_enB7lwsSKnQhAznJWjNS_12" [label="node_jNS-12"];
  "n_enB7lwsSKnQhAznJWjNS_13" [label="tick_us == 1"];
  "n_enB7lwsSKnQhAznJWjNS_14" [label="tick_cnt +1"];
  "n_enB7lwsSKnQhAznJWjNS_15" [label="node_jNS-15"];
  "n_enB7lwsSKnQhAznJWjNS_16" [label="tick_cnt >= 11"];
  "n_enB7lwsSKnQhAznJWjNS_2" [label="IDLE"];
  "n_enB7lwsSKnQhAznJWjNS_24" [label="node_jNS-24"];
  "n_enB7lwsSKnQhAznJWjNS_25" [label="WAIT"];
  "n_enB7lwsSKnQhAznJWjNS_26" [label="trig =0"];
  "n_enB7lwsSKnQhAznJWjNS_27" [label="node_jNS-27"];
  "n_enB7lwsSKnQhAznJWjNS_28" [label="tick_us == 1"];
  "n_enB7lwsSKnQhAznJWjNS_30" [label="node_jNS-30"];
  "n_enB7lwsSKnQhAznJWjNS_31" [label="echo ==1"];
  "n_enB7lwsSKnQhAznJWjNS_32" [label="tick_cnt = 0"];
  "n_enB7lwsSKnQhAznJWjNS_37" [label="node_jNS-37"];
  "n_enB7lwsSKnQhAznJWjNS_38" [label="Respose"];
  "n_enB7lwsSKnQhAznJWjNS_39" [label="tick_us == 1"];
  "n_enB7lwsSKnQhAznJWjNS_40" [label="node_jNS-40"];
  "n_enB7lwsSKnQhAznJWjNS_41" [label="tick_cnt ++"];
  "n_enB7lwsSKnQhAznJWjNS_42" [label="node_jNS-42"];
  "n_enB7lwsSKnQhAznJWjNS_43" [label="echo ==0"];
  "n_enB7lwsSKnQhAznJWjNS_44" [label="node_jNS-44"];
  "n_enB7lwsSKnQhAznJWjNS_45" [label="tick_cnt /58"];
  "n_enB7lwsSKnQhAznJWjNS_5" [label="trig =0"];
  "n_enB7lwsSKnQhAznJWjNS_52" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_53" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_54" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_56" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_58" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_6" [label="node_WjNS-6"];
  "n_enB7lwsSKnQhAznJWjNS_60" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_62" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_65" [label="T"];
  "n_enB7lwsSKnQhAznJWjNS_69" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_7" [label="sr04_start == 1"];
  "n_enB7lwsSKnQhAznJWjNS_70" [label="F"];
  "n_enB7lwsSKnQhAznJWjNS_8" [label="node_WjNS-8"];
  "n_enB7lwsSKnQhAznJWjNS_9" [label="START"];
  "n_x44Eh83IV3G2Vne_8oqs_1" [label="SR04_Controller"];
  "n_x44Eh83IV3G2Vne_8oqs_11" [label="node_oqs-11"];
  "n_x44Eh83IV3G2Vne_8oqs_12" [label="Button debounce"];
  "n_x44Eh83IV3G2Vne_8oqs_13" [label="fnd_controller"];
  "n_x44Eh83IV3G2Vne_8oqs_14" [label="node_oqs-14"];
  "n_x44Eh83IV3G2Vne_8oqs_15" [label="rst"];
  "n_x44Eh83IV3G2Vne_8oqs_16" [label="fnd_com"];
  "n_x44Eh83IV3G2Vne_8oqs_18" [label="fnd_data"];
  "n_x44Eh83IV3G2Vne_8oqs_2" [label="node_8oqs-2"];
  "n_x44Eh83IV3G2Vne_8oqs_22" [label="tick_gen_us"];
  "n_x44Eh83IV3G2Vne_8oqs_23" [label="node_oqs-23"];
  "n_x44Eh83IV3G2Vne_8oqs_24" [label="rst"];
  "n_x44Eh83IV3G2Vne_8oqs_25" [label="tick_us"];
  "n_x44Eh83IV3G2Vne_8oqs_29" [label="node_oqs-29"];
  "n_x44Eh83IV3G2Vne_8oqs_3" [label="sr04_start"];
  "n_x44Eh83IV3G2Vne_8oqs_30" [label="Module_TOP_SR04_Controller"];
  "n_x44Eh83IV3G2Vne_8oqs_31" [label="Btn_R"];
  "n_x44Eh83IV3G2Vne_8oqs_34" [label="node_oqs-34"];
  "n_x44Eh83IV3G2Vne_8oqs_36" [label="rst"];
  "n_x44Eh83IV3G2Vne_8oqs_4" [label="trig"];
  "n_x44Eh83IV3G2Vne_8oqs_6" [label="echo"];
  "n_x44Eh83IV3G2Vne_8oqs_7" [label="tick_us"];
  "n_enB7lwsSKnQhAznJWjNS_5" -> "n_enB7lwsSKnQhAznJWjNS_6";
  "n_enB7lwsSKnQhAznJWjNS_6" -> "n_enB7lwsSKnQhAznJWjNS_8";
  "n_enB7lwsSKnQhAznJWjNS_6" -> "n_enB7lwsSKnQhAznJWjNS_1";
  "n_enB7lwsSKnQhAznJWjNS_8" -> "n_enB7lwsSKnQhAznJWjNS_11";
  "n_enB7lwsSKnQhAznJWjNS_11" -> "n_enB7lwsSKnQhAznJWjNS_12";
  "n_enB7lwsSKnQhAznJWjNS_12" -> "n_enB7lwsSKnQhAznJWjNS_14";
  "n_enB7lwsSKnQhAznJWjNS_14" -> "n_enB7lwsSKnQhAznJWjNS_15";
  "n_enB7lwsSKnQhAznJWjNS_15" -> "n_enB7lwsSKnQhAznJWjNS_24";
  "n_enB7lwsSKnQhAznJWjNS_24" -> "n_enB7lwsSKnQhAznJWjNS_26";
  "n_enB7lwsSKnQhAznJWjNS_26" -> "n_enB7lwsSKnQhAznJWjNS_27";
  "n_enB7lwsSKnQhAznJWjNS_27" -> "n_enB7lwsSKnQhAznJWjNS_30";
  "n_enB7lwsSKnQhAznJWjNS_32" -> "n_enB7lwsSKnQhAznJWjNS_37";
  "n_enB7lwsSKnQhAznJWjNS_30" -> "n_enB7lwsSKnQhAznJWjNS_32";
  "n_enB7lwsSKnQhAznJWjNS_37" -> "n_enB7lwsSKnQhAznJWjNS_39";
  "n_enB7lwsSKnQhAznJWjNS_39" -> "n_enB7lwsSKnQhAznJWjNS_41";
  "n_enB7lwsSKnQhAznJWjNS_41" -> "n_enB7lwsSKnQhAznJWjNS_42";
  "n_enB7lwsSKnQhAznJWjNS_42" -> "n_enB7lwsSKnQhAznJWjNS_45";
  "n_enB7lwsSKnQhAznJWjNS_44" -> "n_enB7lwsSKnQhAznJWjNS_1";
  "n_x44Eh83IV3G2Vne_8oqs_31" -> "n_x44Eh83IV3G2Vne_8oqs_29";
  "n_KuxB96fk1PK30fdosjAa_2" -> "n_KuxB96fk1PK30fdosjAa_4";
  "n_KuxB96fk1PK30fdosjAa_4" -> "n_KuxB96fk1PK30fdosjAa_6";
  "n_KuxB96fk1PK30fdosjAa_6" -> "n_KuxB96fk1PK30fdosjAa_8";
  "n_KuxB96fk1PK30fdosjAa_8" -> "n_KuxB96fk1PK30fdosjAa_2";
  "n_ZWzSoCU0VGYe7Tsr4cPh_1" -> "n_ZWzSoCU0VGYe7Tsr4cPh_2";
  "n_ZWzSoCU0VGYe7Tsr4cPh_2" -> "n_ZWzSoCU0VGYe7Tsr4cPh_4";
  "n_ZWzSoCU0VGYe7Tsr4cPh_4" -> "n_ZWzSoCU0VGYe7Tsr4cPh_9";
  "n_ZWzSoCU0VGYe7Tsr4cPh_4" -> "n_ZWzSoCU0VGYe7Tsr4cPh_1";
  "n_ZWzSoCU0VGYe7Tsr4cPh_9" -> "n_ZWzSoCU0VGYe7Tsr4cPh_11";
  "n_ZWzSoCU0VGYe7Tsr4cPh_11" -> "n_ZWzSoCU0VGYe7Tsr4cPh_13";
  "n_ZWzSoCU0VGYe7Tsr4cPh_13" -> "n_ZWzSoCU0VGYe7Tsr4cPh_16";
  "n_ZWzSoCU0VGYe7Tsr4cPh_13" -> "n_ZWzSoCU0VGYe7Tsr4cPh_9";
  "n_ZWzSoCU0VGYe7Tsr4cPh_16" -> "n_ZWzSoCU0VGYe7Tsr4cPh_18";
  "n_ZWzSoCU0VGYe7Tsr4cPh_18" -> "n_ZWzSoCU0VGYe7Tsr4cPh_20";
  "n_ZWzSoCU0VGYe7Tsr4cPh_18" -> "n_ZWzSoCU0VGYe7Tsr4cPh_9";
  "n_ZWzSoCU0VGYe7Tsr4cPh_20" -> "n_ZWzSoCU0VGYe7Tsr4cPh_26";
  "n_ZWzSoCU0VGYe7Tsr4cPh_26" -> "n_ZWzSoCU0VGYe7Tsr4cPh_28";
  "n_ZWzSoCU0VGYe7Tsr4cPh_28" -> "n_ZWzSoCU0VGYe7Tsr4cPh_20";
  "n_ZWzSoCU0VGYe7Tsr4cPh_28" -> "n_ZWzSoCU0VGYe7Tsr4cPh_34";
  "n_ZWzSoCU0VGYe7Tsr4cPh_34" -> "n_ZWzSoCU0VGYe7Tsr4cPh_36";
  "n_ZWzSoCU0VGYe7Tsr4cPh_34" -> "n_ZWzSoCU0VGYe7Tsr4cPh_20";
  "n_ZWzSoCU0VGYe7Tsr4cPh_36" -> "n_ZWzSoCU0VGYe7Tsr4cPh_41";
  "n_ZWzSoCU0VGYe7Tsr4cPh_41" -> "n_ZWzSoCU0VGYe7Tsr4cPh_43";
  "n_ZWzSoCU0VGYe7Tsr4cPh_43" -> "n_ZWzSoCU0VGYe7Tsr4cPh_47";
  "n_ZWzSoCU0VGYe7Tsr4cPh_43" -> "n_ZWzSoCU0VGYe7Tsr4cPh_41";
  "n_ZWzSoCU0VGYe7Tsr4cPh_47" -> "n_ZWzSoCU0VGYe7Tsr4cPh_49";
  "n_ZWzSoCU0VGYe7Tsr4cPh_49" -> "n_ZWzSoCU0VGYe7Tsr4cPh_51";
  "n_ZWzSoCU0VGYe7Tsr4cPh_51" -> "n_ZWzSoCU0VGYe7Tsr4cPh_1";
}
